In [2]:
import numpy as np
import pandas as pd

## What pandas dataframes are?

Are bidimensional data structures similar to a table in excel or SQL, it has rows and columns, where each column can has a different type of data, its suitable for data analysis.

In [5]:
file_path = "./Online_Retail.csv"
sales_data = pd.read_csv(file_path, encoding="windows-1252")

sales_data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [7]:
data = np.array(
    [
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ]
)

df_from_array = pd.DataFrame(data, columns=["A", "B", "C"])
df_from_array

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

DataFrames can be also be created from simpler data types like lists or dictionaries

In [9]:
data2 = [
    [1, "Jhon", 22],
    [2, "Anna", 24]
]

df_from_list = pd.DataFrame(data2, columns=["id", "Name", "Age"])
df_from_list

   id  Name  Age
0   1  Jhon   22
1   2  Anna   24

In [13]:
data3 = [
    {
        "id": 1,
        "Name": "Jhon",
        "Age": 22,
    },
    {
        "id": 2,
        "Name": "Anna",
        "Age": 24,
    },
]

df_from_dict = pd.DataFrame(data3)
df_from_dict

   id  Name  Age
0   1  Jhon   22
1   2  Anna   24

In [14]:
data4 = {
    "id": [1, 2, 3],
    "Name": ["Jhon", "Anna", "Alan"],
    "Age": [22, 24, 44],
}

df_from_dict_list = pd.DataFrame(data4)
df_from_dict_list

   id  Name  Age
0   1  Jhon   22
1   2  Anna   24
2   3  Alan   44

We can decompose a DataFrame to a series, a serie is a column, a unidimensional data

### List to series, series to columns, and columns to DataFrame

In [15]:
data5 = {
    "id": pd.Series([1, 2, 3]),
    "Name": pd.Series(["Jhon", "Anna", "Alan"]),
    "Age": pd.Series([22, 24, 44])
}

df_from_series = pd.DataFrame(data5)
df_from_series

   id  Name  Age
0   1  Jhon   22
1   2  Anna   24
2   3  Alan   44